# Import the necessary libraries and read the dataset

In [94]:
import pandas as pd
df=pd.read_csv('datasets/US_Baby_Names_right.csv')
df.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

# Delete the column 'Unnamed: 0' , 'Id' and 'Year'

In [95]:
del df['Unnamed: 0']

df.head()

      Id     Name  Year Gender State  Count
0  11350     Emma  2004      F    AK     62
1  11351  Madison  2004      F    AK     48
2  11352   Hannah  2004      F    AK     46
3  11353    Grace  2004      F    AK     44
4  11354    Emily  2004      F    AK     41

In [96]:
del df['Id']

df.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

In [97]:
del df['Year']

df.head()

      Name Gender State  Count
0     Emma      F    AK     62
1  Madison      F    AK     48
2   Hannah      F    AK     46
3    Grace      F    AK     44
4    Emily      F    AK     41

# Is there more male or female names in the dataset?

In [98]:
df['Gender'].value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

# Group the dataset by name and assign to names

In [101]:
names=df.groupby('Name').sum()
names.head()

         Count
Name
Aaban       12
Aadan       23
Aadarsh      5
Aaden     3426
Aadhav       6

In [104]:
names.sort_values('Count',ascending=False).head()
# sort it from the biggest value to the smallest one

           Count
Name
Jacob     242874
Emma      214852
Michael   214405
Ethan     209277
Isabella  204798

# How many different names exist in the dataset?

In [111]:
len(names)
# as we have already grouped by the name, all the names are unique already. 
# get the length of names

17632

# What is the name with most occurrences

In [112]:
names.Count.idxmax()
# OR

# names[names.Count == names.Count.max()]

'Jacob'